{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Computer Science, Mathematics, and Statistics: Machine learning and data science",
      "duration": "2016-2020",
      "school_name": "University of Toronto Scarborough"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ZacharyBarlow",
  "highlighted_projects": [
    {
      "description": "Developed an online multiplayer bingo game using Socket.IO and Node.js for the rooms and connections and then React for the frontend where the game updates for every change to the game without refreshing.",
      "git_url": "https://github.com/zachary-barlow/Bingo",
      "name": "Bingo Web Application"
    },
    {
      "description": "Created a bookstore inventory system where I created an API and made database calls with Knex and made a dashboard with ReactJs where you can add, edit, and delete books, as well as receive notifications when a book is out of stock.",
      "git_url": "https://github.com/zachary-barlow/VentionProject",
      "name": "Bookstore Inventory"
    },
    {
      "description": "Integrated an ETL pipeline from web scraping data from tables for the Toronto Blue Jays and manipulated and changed the data in certain columns and inserted them into an SQLite database and uploaded the dataset to Kaggle.",
      "git_url": "",
      "name": "Web Scraping ETL"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux clustering monitoring agent that can be used to manage and monitor nodes/server hardware specifications. Created a PostgreSQL instance from a docker container running a CentOS7 image and activated a crontab to run a bash script to collect the data every minute and insert it into the database. As well as creating a few SQL queries that the manager can use to check host failures on specific machines.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a command-line interface using Java 8 to allow the user to create, read, and delete tweets using the Twitter API. Architected the application using the MVC design pattern and Java Spring framework. Tested the application using JUnit4 and Mockito to perform the unit and integration tests to ensure proper functionality and created a docker file to deploy an image to docker hub.",
        "JDBC App: Implemented a DAO in terms of a Customer and Orders and demonstrated how they are connected to DTOs and the abstraction layer. Using Maven, Java, Docker, and PostgreSQL for the RDBMS.",
        "Grep App: Implemented a copy cat Linux grep command in Java using two separate implementations and hosted it on Docker Hub. The two implementations are using strictly for loops and the other, updated for more performance was using Streams and Lambda functions."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed a Proof of Concept microservice trading application that allows users to manage client profiles and accounts, monitor portfolio performance, and trade securities using Java8 and Springboot to implement the REST API coming from IEX Cloud to handle all the business and core logic of the application. It is tested using Junit4 integration tests and uses Docker to deploy and package the application with a Maven image and push the project images (psql image and application image) to the Docker Hub.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Performed data analytics against a data warehouse stored in Postgres and ingested from the London Gift Shop retail database. It is a proof of concept app that is analyzed in a Jupyter Notebook using Python Pandas, NumPy, and Matplotlib for graphs. It is used to help the team use the analytics provided to analyze their customer behaviour and shape their marketing strategies to attract new and existing customers. ",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Created an extension on top of the PoC trading application which is used for processing the data using Apache Hadoop and evaluate the different technologies and tools. Created a Hadoop cluster with 1 master node and 2 worker nodes to be able to run the jobs in Hive using Tez as well as MapReduce jobs on the command line. For the Hive queries, I created a Zeppelin notebook to test different querying processes such as partitions and columnar tables and analyzed the differences.",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Zachary Barlow",
  "others": [
    {
      "bullets": [
        "GCP Big Data and Machine Learning Fundamentals",
        "IBM Databases and SQL for Data Science",
        "Introduction to TensorFlow for Artificial Intelligence, Machine Learning, and Deep Learning",
        "Convolutional Neural Networks in TensorFlow"
      ],
      "title": "Certificates"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting",
      "description": "Have learned and progressed through a variety of projects from Linux, to Java API tools. I have used a variety of tools such as Linux, Git, Java, Docker, RDBMS, and led a team of three using an Agile Scrum approach to daily meetings and ideologies.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Public Services and Procurement Canada",
      "description": "Developed and worked on the Public Accounts 2016-2017 version and improved efficiency on production by implemented methods for more edge cases in tables. I also updated server information and web services they use to new and brighter formatting.",
      "duration": "Sept 2017 - Dec 2017",
      "title": "Full Stack Software Developer Co-op"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "React",
      "Hadoop/Hive",
      "NumPy",
      "Docker",
      "Excel",
      "HTML5/CSS",
      "Jupyter Notebook/Zeppelin",
      "Maven",
      "Springboot"
    ],
    "familiar": [
      "Pandas",
      "TensorFlow",
      "Express.js",
      "Node.js",
      "Google Cloud Platform",
      "R",
      "Computer Networking",
      "Django"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python"
    ]
  },
  "summary": "My name is Zachary Barlow and I graduated from the University of Toronto Scarborough campus with a degree in Statistics, specializing in Software Engineering, Machine learning, and Data Science. I have joined Jarvis Consulting as a Data Engineer/Software Developer in pursuit of shaping my future and working with top employers in our country. I am working through a variety of projects relating to the use of Java 8, Linux/Bash, Spring Boot, RDBMS, Maven, Docker, and more. I am an extremely eager and passionate individual looking for a position within an amazing team to show off my skills with and push not only my progress but their company further."
}
